# IsBendingRadiusChanged Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..IsBendingRadiusChanged Property
RebarUpdateCurvesData Class See Also
---
Indicates if the bending radius has changed since the last regeneration.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool IsBendingRadiusChanged { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsBendingRadiusChanged As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsBendingRadiusChanged {
	bool get ();
}
```

# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace